export const sampleSindhi = `شاهه عبداللطيف (1102/1690-1165/1752) جو شمار دنيا جي چند اهڙن عظيم شاعرن ۾ ٿئي ٿو، جن جي شاعري وقت گذرڻ سان عوام توڻي خواص کي وڌيڪ متاثر ۽ متوجهه ڪري رهي آهي. ان جو هڪڙو وڏو سبب سندس شاعريءَ ۾ انساني امنگن ۽ جذبن جو اهڙو اظهار آهي، جيڪو حقيقت جي ترجماني ڪري ٿو ۽ ٻيو سندس شاعريءَ ۾ اعليٰ شعور يعني ڳوڙهي سوچ ۽ فڪر جو موجود هجڻ آهي. اهو ئي سبب آهي، جو شاهه لطيف جي شاعريءَ کي وڏن عالمن، صوفين ۽ شاعرن معيار ۽ ڪسوٽي سمجهي ان جي تشريح ۽ تعبير جي ڪوشش ڪئي آهي. اِن سلسلي ۾ سڀ کان پهريائين سنڌ جي مشهور عالم ۽ صوفي عبدالرحيم گرهوڙيءَ جو نالو اچي ٿو ۽ اُن کان پوءِ عبدالقادر بيدل آهي. هنن ٻنهي شاهه لطيف جي شاعريءَ کي عربي ۽ فارسيءَ جي عظيم صوفي شاعرن جهڙوڪ مولانا رومي، حافظ شيرازي، مولانا جامي ۽ ٻين جي شاعري سان گڏ بيهاري حوالي ۽ سمجهاڻي طور آندو آهي. خاص طور صوفي فڪر ۽ عرفان جي حوالي سان هو شاهه جي بيتن کي سَند طور استعمال ڪن ٿا. اهڙيءَ طرح سنڌ جي وڏن صوفين جي ملفوظات ۾ صوفيانه فڪر جي تشريح ۽ سمجهاڻي خاطر پڻ شاهه جي بيتن کي استعمال ڪيو ويو آهي.

شاهه لطيف جي شاعري جو اهو فڪري پهلو هيو، جنهن عالمن کي شاهه لطيف جي شعر جي تشريح ۽ سمجهاڻي طرف راغب ڪيو. اِن سلسلي ۾ سڀ کان پهرين سنڌي ٻوليءَ جي عظيم محسن
شمس العلماءَ مرزا قليچ بيگ قلم کنيو، جنهن نه صرف رسالي کي نئين سر مرتب ڪيو، بلڪه ڪن چونڊ سُرن جي معنيٰ ۽ سمجهاڻي طرف وک وڌائي. آخر ۾ ’لغات لطيفي‘ پڻ مرتب ڪيائين. مرزا صاحب کان پوءِ شاهه لطيف جي رسالي کي جديد تحقيقي انداز ۾ ترتيب ڏيڻ ۽ان جي معنيٰ ۽ شرح جو ڪم
ڊاڪٽر گربخشاڻي ڪيو، ليڪن اهو ڪم نامڪمل رهجي ويو. اِن سلسلي ۾ آخري وڏي ڪوشش
محترم ڊاڪٽر نبي بخش خان بلوچ جي تحقيق جي صورت ۾ سامهون آئي، جيڪا سال 1998ع ۾ تڪميل تي پهتي. ڊاڪٽر صاحب جو سمورو ڌيان شاهه جي ڪلام جي مستند متن کي تيار ڪرڻ تي رهيو ۽ سندس خيال ۾ وٽن ايترو وقت نه هيو، جو شاهه جي شرح کي هٿ ۾ کڻن. جيتوڻيڪ شاهه جي ڪلام جي پهرين جلد ۾ ’ڪلياڻ‘ ۽ ’يمن ڪلياڻ‘ جي سمجهاڻي شامل ڪئي ويئي، پر پوءِ باقي سُرن ۾ صرف لفظن ۽ اصطلاحن جي معنيٰ تي اڪتفا ڪئي ويئي.

انهيءَ پس منظر ۾ ڊاڪٽر صاحب جو رهيل ڪم سمجهي باقي سُرن جي سمجهاڻي ۽ مفهوم لکڻ جو ڪم هٿ ۾ کنيو ويو. هتي اهو ٻڌائڻ ضروري آهي ته شاهه جي سُرن جي اها سمجهاڻي لکندي، مون سمورو وقت رومي جي مثنويءَ کي آڏو رکيو آهي، بلڪه مون کي اهو ٻڌائڻ ۾ ڪو تامل ڪونهي ته جيڪڏهن مثنوي سامهون نه رکجي ها ته معنوي انداز وارا گهڻا بيت نه پوريءَ طرح سمجهه ۾ اچن ها ۽ نه وري اُنهن جو ڪو مفهوم ڀرپور انداز سان واضح ٿي سگهي ها. هتي اهو پڻ واضح ڪجي ته سنڌي اساسي شاعريءَ ۾ مثنوي روميءَ جو پڙاڏو سڀ کان پهرين شاهه عبدالڪريم بلڙيءَ واري جي بيتن ۾ ملي ٿو. اها مستند روايت پڻ قابل توجهه آهي ته شاهه لطيف هميشه پاڻ سان ’قرآن شريف‘، ’مثنوي رومي‘ ۽ ’بيان العارفين‘  رکندو هو. اِن سلسلي ۾ شاهه لطيف جي پهرئين سوانح نگار مير عبدالحسين سانگيءَ ’لطائف لطيفيءَ‘ ۾ لکيو آهي ته هن پاڻ ڀٽ شاهه تي انهن ٽنهي ڪتابن جي زيارت ڪئي هئي، جيڪي سندس وقت تائين ڀٽ شاهه تي محفوظ هئا. اها روايت پڻ مير سانگيءَ بيان ڪئي آهي ته وقت جي حڪمران ميان نور محمد ڪلهوڙي شاهه صاحب کي مثنويءَ جو قيمتي نسخو تحفي طور ڏياري موڪليو هو.

بهرحال شاهه لطيف جي فڪر ۽ عرفان تي مولانا روميءَ جي اثرات جي وڏي ۾ وڏي شاهدي خود رسالي مان ملي ٿي. مولانا رومي دنيا جو اُهو واحد شاعر آهي، جنهن جو سُر ڪلياڻ جي ڇهن بيتن ۾ شاهه لطيف نالو کڻي سندس فڪر جي تعريف ڪري ٿو. بلڪه کيس پنهنجو فڪري رهنما تسليم ڪري ٿو، جيئن هنن ٻن بيتن مان چڱيءَ ريت واضح ٿئي ٿو:

طالب قصر، سونهن سَرُ، ايءَ روميءَ جي رهاڻ،

پهرين وڃائڻ پاڻ، پَسڻ پوءِ پرينءَ کي.

ــــ

طالب قصر، سونهن سَرُ، ايءَ روميءَ جو آهي،

تاڙِي جي لاهي، ته منجهين مشاهدو ٿئي.

عالمن شاهه لطيف ۽ مولانا روميءَ جي صوفيانه فڪر جا چار اهم مشترڪه نڪتا هن ريت نروار ڪيا آهن:

(1) پاڻ وڃائڻ، جنهن کي مرڻ کان اڳ مرڻ چون ٿا.

(2) محبوب جو مشاهدو يا پرينءَ جو پسڻ

(3) طالب ۽ سالڪ جو روحاني سفر

(4) سالڪن ۽ عارفن جي حال ۽ مقام جي سمجهاڻي

اِن سلسلي ۾ انگريز مستشرق ايڇ. ٽي. سورلي، جنهن پنهنجي حياتيءَ جو وڏو عرصو سنڌ ۾ گذاريو ۽ شاهه عبداللطيف تي انگريزيءَ ۾ عالمانه مقالو  لکي ڊاڪٽريٽ جي سَند حاصل ڪئي، پنهنجي مشهور تصنيف ’شاهه عبداللطيف ڀٽائي‘ ۾ لکي ٿو:

To what extent Shah Abdul Latif was acquainted with the great Persian poets, we do not know. There is no evidence that he had studied any of them except Jalaluddin Rumi, copy of whose Masnvi was said to be constantly in his hands.(P-242)

ترجمو: ’اسان اهو نٿا چئي سگهون ته شاهه عبداللطيف فارسي ٻوليءَ جي وڏن شاعرن کان ڪيتري قدر واقف هو يا ڄاڻ رکندو هو. اهڙي ڪابه شاهدي نٿي ملي  ته هن روميءَ کان سواءِ ڪنهن ٻئي شاعر جو مطالعو ڪيو هجي، جنهن جي مثنوي هر وقت سندس هٿن ۾ هوندي هئي.‘

بحث کي اڳتي وڌائيندي هيءُ نتيجو قائم ڪري ٿو:

All these ideas will be found in the poetry of Shah Abdul Latif who represents an Indian Muslim development of Jalaluddin Rumi. (P-240)

ترجمو: ’اهي سڀ افڪار شاهه لطيف جي شاعريءَ ۾ ملن ٿا. انهيءَ ڪري اسان کيس برصغير ۾ جلال الدين روميءَ جي فڪر جي اوسر ڪوٺي سگهون ٿا.‘

سورلي جنهن عربي ۽ فارسي ٻوليءَ جي سڀني وڏن صوفي شاعرن جو مطالعو ڪيو هو، جيئن سندس ٻئي ڪتاب Musa Pervagans مان پڻ ظاهر ٿئي ٿو، وڌيڪ وضاحت ڪندي لکي ٿو:

Nor need we account for these similarties by arguing that Shah Abdul Latif must have been familiar with the work of many of the Persian masters. Even if he had known only Jalaluddin Rumi and nothing of Jami, Fariduddin Attar, Bayazid of Bistam, Hafiz, Sadai, or Abu Said Abul Khair, the explanation would be fully sufficient.(P-243)

ترجمو: ’هتي اسان کي انهيءَ بحث ۾ پوڻ جي ضرورت ناهي ته شاهه عبداللطيف ضرور فارسي زبان جي وڏن صوفي شاعرن کان چڱيءَ ريت واقف هوندو، ڇو ته هن لاءِ جلال الدين روميءَ کي سمجهڻ ئي هر لحاظ کان ڪافي هو، پوءِ ڀلي هن کي جامي، فريد الدين عطار، بايزيد بسطامي، حافظ، سعدي ۽ ابو سعيد ابو الخير جي ڪا ڄاڻ نه هجي. اسان جي مقصد لاءِ اها سمجهاڻي ڪافي آهي.‘

سورلي کان پوءِ انيمري شمل (Annemarie Schimmel) جي راءِ به ساڳئي قسم جي آهي:

Shah Abdul Latif did use the inherited language of the Sufis, he himself acknowledged his indebtedness to Rumi, and his work can not be fully appreciated without a though knowledge of the different currents of Sufism in Iran and India (Mystical Dimensions of Islam, P-393)

ترجمو: ’شاهه عبداللطيف صوفين کان ورثي ۾ مليل ٻولي ۽ اصطلاح استعمال ڪيا آهن. اِن سلسلي ۾ هو مولانا روميءَ جو خاص طور اعتراف ڪري ٿو. هونئن سندس فڪر کي ايستائين چڱيءَ طرح نه سمجهي سگهبو، جيستائين ايران ۽ برصغير هند و پاڪ ۾ تصوف جي تحريڪ ۽ روايت بابت پوريءَ ريت ڄاڻ حاصل نه ڪئي ويئي آهي.‘

هاڻي اسان شاهه لطيف جي فڪر بابت سورلي جي ڳالهه کي اڳتي وڌائيندي شاهه لطيف جي ڪلام جي سمجهاڻي ۽ مفهوم خاطر هر سُر اندر آيل روميءَ جا ڪجهه اشعار مثال خاطر پيش ڪريون ٿا ته جيئن رومي ۽ شاهه لطيف جي اصلي فڪري هم آهنگي واضح ٿي سگهي.

شاهه لطيف رسالي جي پهرئين سُر ڪلياڻ ۾ ٻڌائي ٿو ته صوفي ڪنهن کي چئجي؟ اِن سلسلي ۾ هو واضح ٿو ڪري ته:

حاصل جان نه حال، صوفي جم سڏائيين،

ڪونهي   تنين   قال،  وٿون  جن  وڃائيون.

مثنويءَ ۾ ’حال‘ ۽ ’قال‘ تي گهڻو بحث ملي ٿو، پر هڪ هنڌ ’صاحب حال‘ جي اهميت کي واضح ڪندي رومي چوي ٿو:

ما  زبان  را  ننگريم  و قال را،

ما درون را بنگريم و حال را.

معنيٰ: اسان توهان جي ڳالهه ٻولهه يا ’قال‘ کي نظر ۾ نٿا آڻيون. اسان توهان جي دلين ۾ ۽ اندر ۾ ڏسون ٿا ۽ توهان جي ’حال‘ بابت خبر رکون ٿا.

سُر ڪلياڻ ۾ هڪ نهايت معنيٰ خيز بيت آهي:

ڪاري  رات،  اڇو  ڏينهن،  ايءَ  صفتان نور،

جتي پرين  حضور،  تتي  رنگ  نه  روپ ڪو.

’نور‘ جون ڪهڙيون صفتون آهن ۽ نور کي اسان ڪيئن ڏسي يا محسوس ڪري سگهون ٿا. اتان ئي روشنيءَ ۽ اوندهه جو تصور اڀري ٿو. اصلي سپرينءَ جو روپ ڇو ڪونهي، رنگي ۽ بي رنگي ڇا آهي؟ اصل ۾ بي رنگ ذات ڪير آهي؟ اهي سڀ فڪري نڪتا مثنويءَ جي ڪيترن ئي شعرن ۾ سمجهايل آهن، پر اسين هتي صرف ٻن تي اڪتفا ڪريون ٿا:

پس نهانيها به ضد پيدا شود،

چونکه حق را نيست ضد، پنهان بود.

(دفتر اول، ب-1131)

معنيٰ: سڀ لڪل شيون پنهنجي مخالف يا ضد جي ڪري ظاهر ٿينديون آهن، جيئن ته حق تعاليٰ جو ڪو ضد ناهي، تنهنڪري هو پوشيده يا لڪل آهي.

’رنگ ۽ بيرنگيءَ‘ جي باري ۾ روميءَ جي سوچيل سمجهيل راءِ هن ريت آهي:

اين عجب کين رنگ از بيرنگ خاست،

رنگ با بيرنگ  چون  درجنگ  خاست؟

معنيٰ: تعجب آهي ته سڀ رنگ بي رنگيءَ مان پيدا ٿين ٿا. جيڪڏهن ائين آهي ته پوءِ رنگ ۽ بيرنگيءَ جو پاڻ ۾ ڪهڙو جهيڙو ٿي سگهي ٿو!

سر يمن ڪلياڻ جو پهريون بيت هن ريت آهي:

حبيب تون، طبيب تون، تون درد  جي دوا،

جانب منهنجي جيءَ ۾، آزار جا انوا،

صاحب ڏئين شفا، ميان مريضن کي.

روميءَ وٽ پڻ عشق يعني محبوب جو ساڳيو تصور آهي:

شاد باش اي عشق خوش سوداي ما،

اي طبيب جمله علتهاي ما.

معنيٰ: شال خوش هجين. اي منهنجا محبوب، منهنجي دلپسند بيماري! تون ئي ته منهنجي سڀني بيمارين جو معالج ۽ طبيب پڻ آهين.

رومي طبيب ۽ حبيب واري فرق کي وڌيڪ فڪري انداز ۾ سمجهائيندي چوي ٿو:

صحت اين حس بجوئيد از طبيب،

صحت آن حس بجوئيد از حبيب.

معنيٰ: هن ظاهري جسم جي صحت لاءِ دنيا جي طبيبن وٽ وڃ، پر روحاني صحت لاءِ حبيب يعني سڄڻ يا محبوب جي ڳولا ڪر!

شاهه لطيف انهيءَ ساڳئي فرق کي قائم رکندي چوي ٿو:

او ڏکندو او ٿيي، هادي جنهن حبيب،

تر تفاوت نه ڪري، تنـﮧ کي ڪو طبيب،

رهنما رقيب، ساٿر آهي سپرين.

شاهه لطيف سر کنڀات ۾ پيغمبر اسلام جي ذات بابرڪت جي ظهور بابت چوي ٿو:

پيشانيءَ ۾ پرينءَ جي، ڀلائي جا ڀير،

اڱڻ اڪنڍين جي، ڏي پاٻوهي پير،

قمر پاڙي ڪير، شمس سپيرينءَ سين.

رومي پڻ استعاري جي انداز ۾ چوي ٿو:

يار آمد عشق را روز آفتاب،

آفتاب آن روي را همچو نقاب.

معنيٰ: اهو محبوب عاشقن لاءِ ڏينهن جي سج وانگر آهي، بلڪه هي ظاهري سج ان محبوب جي چهري اڳيان هڪڙو نقاب يا پردو آهي. کنڀات ۾ هڪ ٻيو معنوي بيت آهي:

کڻي نيڻ خمار مان، جان ڪئائون ناز نظر،

سُورج شاخون جُهڪيون، ڪوماڻو قمر،

تارا، ڪَتيون، تائب ٿئا، ديکيندي دلبر،

جهَڪو ٿئو جوهر، جانب جي جمال سين.

روميءَ جا الفاظ ڏسو ته هو ڪيئن خراج عقيدت پيش ڪري ٿو:

آفتاب حق برآمد از حجل،

زير چادر رفت خورشيد از خجل.

نور مردان مشرق و مغرب گرفت،

آسمانها سجده کردند از شگفت.

معنيٰ: جڏهن حق جو سج ڇپرکٽ تي نمودار ٿيو ته هيءُ ظاهري سج شرمندگيءَ وچان چادر هيٺ لڪي ويو. انهن مردن جي روشني اوڀر ۽ اولهه تائين پهچي ويئي. آسمان جا نکٽ عاجزيءَ وچان جهڪي پيا.

اِن سلسلي جو ٻيو بيت ڏسو:

ناز منجهارا نڪري، جڏهن پرين ڪري ٿو پنڌ،

ڀون پڻ ’بسم الله‘ چئي، راهه چمي ٿي رَند،

اُڀيون گهڻي ادب سين، حورون حيرت هنڌ،

سائينءَ جو سوڳنڌ، ساجن سڀنئان سهڻو.

سمجهاڻي: منهنجو محبوب جڏهن ناز (مان ۽ شان) سان نڪري هلڻ شروع ڪري ٿو ته ڌرتي پڻ ’بسم الله‘ (ڀلي آئين اصطلاحي مفهوم) چوي ٿي، ۽ اُهو هنڌ يا رستو (جنهن تان پرين هلي ٿو) سندس پيرن جا نشان چمي ٿو. (انهيءَ مهل) حورون (هٿ ٻڌي) ادب سان اچي بيهن ٿيون ۽ (ديدار ڪري)حيرت ۾ پئجي وڃن ٿيون. مون کي مالڪ سائينءَ جو قسم آهي ته منهنجو محبوب (ڪائنات جي هر شيءِ کان) وڌيڪ حسين آهي. 

هن بيت ۾ رسول الله صلي الله عليه وسلم جي معراج واري واقعي ڏانهن واضح اشارو آهي، جيئن مثنويءَ ۾ پڻ رومي نالي کڻڻ کان سواءِ اهو سڀ ڪجهه چئي ويو آهي:

آنکه او از مخزن هفت آسمان،

چشم دل بربست روز امتحان.

از پئي نظارهء او حور و جنان،

پر شده آفاق هر هفت آسمان.

قدسيان افتاد برخاک رهش،

صد چو يوسف او فتاده درچهش.

خويشتن آراسته از بهر او،

خود ورا پرواي غير دوست کو.

 (دفتر اول، ب- 3949-52)

معنيٰ: هن (سهڻي سڄڻ) ان امتحان واري ڏينهن ستن آسمانن جي دولت ڏانهن اک کڻي نه نهاريو. هوڏانهن سندس ديدار لاءِ حورون ۽ ٻيا ارواح ستن آسمانن تي گڏ هئا. قدسي فرشتا سندس پيرن جي خاڪ کي چمي رهيا هئا. حضرت يوسف عه جهڙا سوين سندس مشتاق هئا. هن جي واسطي سڀني پاڻ کي سينگاريو ۽ سنواريو هو. ليڪن پاڻ سڳورن کي دوست (الله تعاليٰ) کان سواءِ ٻئي ڪنهن جو فڪر نه هو.

سر سريراڳ ۾ سمنڊ مان ماڻڪ موتي ڳولي لهڻ جو نظارو چٽيندي شاهه لطيف چوي ٿو:

سيوا ڪر سبحان جي، جت جر وهي ٿو جال،

سوين وهن سمونڊ ۾، ماڻڪ موتي لال،

جي ماسو جُڙئي مال، ته پوڄارا پُر ٿئين.

رومي اها ساڳي حقيقت هن ريت بيان ڪري ٿو:

که بيائيد اي عزيزان زود زود،

که برآمد موجها از بحر جود.

سوي ساحل مي فشاند بي خطر،

جوش موجش هر زماني صد گهر.

معنيٰ: اي دوستئو، جلدي هن طرف اچو، ڇو ته سخا جي سمنڊ جون موجون هن طرف پيون اچن. اهي موجون سمنڊ جي ساحل ڏانهن پيون وڌن ۽ اهي پنهنجي هر موج ۾ سوين موتي پيون آڻين.

سر سامونڊيءَ ۾ شاهه لطيف غواصن هٿان ماڻڪ موتي ميڙڻ جو ذڪر ڪندي چوي ٿو:

اِيءَ گت غواصن، جئن سمنڊر سوجهئائون،

پيهي منجهه پاتار جي، ماڻڪ ميڙئائون،

آڻي ڏنائون، هيرا لعل هٿن سين.

مثنويءَ ۾ به غواصن جي ان مهارت جو ذڪر ملي ٿو، جنهن سان هو سمنڊ جي پاتار مان موتي ڳولي يا ڪڍي اچن ٿا.

يا چو غواصان بزير قعر آب،
هر کسي چيزي همي گيرد شتاب،
بر اميد گوهر و در ثمين،
توبره پر ميکنند از آن و اين.

(دفتر پنجم، ب- 331-32)

معنيٰ: جهڙيءَ طرح هر غواص سمنڊ جي گهرائيءَ ۾ وڃي کيس جيڪا شيءِ ملي ٿي، هٿ ڪري اچي ٿو، پر هر وقت هو اها ئي اميد رکندو آهي ته کيس قيمتي موتي ۽ ماڻڪ ملن، تنهن ڪري هو پنهنجي ٿيلهي هر قسم سان ڀري کڻندو آهي.

شاهه لطيف وٽ سر گهاتوءَ ۾ مانگر مڇ جو ذڪر هن ريت ملي ٿو:

متو  آهين  مڇ،  ٿلهو  ٿئو  ٿونا هڻين،

جا تو ڏٺي اڇ، تنهن پاڻيءَ پنا ڏينهڙا.

رومي وري هن دنيا کي مانگر مڇ جي وات سان تشبيهه ڏيندي چوي ٿو:

اين جهان پر ز نقل و پر ز نان،

چون دهان باز تمساح دان.

بهر کرم و طعمه اي روز تراش،

از فن تمساح دهر ايمن مباش.

(دفتر ششم، ب- 4086 ۽ 87)

معنيٰ: هيءَ جهان مانگر مڇ جو کليل وات سمجهه، جنهن جي پاسن تي کائڻ جون ڪيتريون مٺيون شيون لڳل آهن. تو هن جي وات وارين شين (مڪر) کي کاڌو سمجهيو آهي. ياد رک، مانگر مڇ جي ان چالاڪيءَ کان ڪڏهن بي خبر نه ٿجانءِ.`;
